; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	infrared0 - mode
	image3 - mode
	image1 - mode
	spectrograph2 - mode
	spectrograph4 - mode
	Star0 - direction
	Star3 - direction
	GroundStation1 - direction
	Star2 - direction
	Star4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(supports instrument0 image3)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star2)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(have_image Phenomenon5 spectrograph2)
	(have_image Phenomenon6 image1)
	(have_image Star7 infrared0)
	(have_image Planet8 image3)
	(have_image Star9 spectrograph4)
	(have_image Star10 image1)
	(have_image Star11 image3)
))

)

; plan
1. (turn_to satellite1 star4 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star4)
   goals met: 0 of 8
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
3. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 0 of 8
4. (turn_to satellite1 phenomenon5 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon5)
   goals met: 0 of 8
5. (take_image satellite1 phenomenon5 instrument3 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 1 of 8
6. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
7. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 1 of 8
8. (turn_to satellite0 phenomenon6 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon6)
   goals met: 1 of 8
9. (take_image satellite0 phenomenon6 instrument0 image1)
   added: (have_image phenomenon6 image1)
   goals met: 2 of 8
10. (turn_to satellite0 planet8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet8)
   goals met: 2 of 8
11. (take_image satellite0 planet8 instrument0 image3)
   added: (have_image planet8 image3)
   goals met: 3 of 8
12. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 3 of 8
13. (take_image satellite0 star10 instrument0 image1)
   added: (have_image star10 image1)
   goals met: 4 of 8
14. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 4 of 8
15. (take_image satellite0 star11 instrument0 image3)
   added: (have_image star11 image3)
   goals met: 5 of 8
16. (turn_to satellite0 star7 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star7)
   goals met: 5 of 8
17. (take_image satellite0 star7 instrument0 infrared0)
   added: (have_image star7 infrared0)
   goals met: 6 of 8
18. (turn_to satellite0 groundstation1 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation1)
   goals met: 7 of 8
19. (turn_to satellite1 star9 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star9)
   goals met: 7 of 8
20. (take_image satellite1 star9 instrument3 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 8 of 8
